{
  "en": {
    "h_e_1": "End-to-end encryption messenger in which you are confident",
    "h_e_2": "Unlike Telegram, WhatsApp, etc. we don't generate and store private keys, you create and store them yourself. Only you and your interlocutor have access to your messages. Built on Diffie-Hellman key exchange and AES encryption with a secret key on the client side",
    "h_e_3": "Create an account with a username and password only. Completely free.",
    "h_e_4": "Exchange with each other the usernames through regular communication channel",
    "h_e_5": "The first user creates the room, the second user confirms",
    "h_e_6": "Enter your private key to read, send and receive messages",
    "h_e_7": "For testing create a room for user messedges",
    "c_a": "Create an account",
    "l_i": "Log in",
    "u_n": "Username",
    "p_w": "Password",
    "l_h": "length",
    "o_t_a": "Only two accounts per IP",
    "l_e": "Language",
    "s_e": "Save",
    "i_u": "Interlocutor's username",
    "p_k": "Private key",
    "c_r": "Create room",
    "s_p_k": "Set Private Key",
    "c_m": "Confirm",
    "w_g": "Waiting",
    "m_s": "messages",
    "u_d": "unread",
    "d_r": "Delete room",
    "w_m": "Write a message",
    "a_r": "Avatar"
  },
  "ru": {
    "h_e_1": "Мессенджер со сквозным шифрованием, в котором вы уверены",
    "h_e_2": "В отличие от Telegram, WhatsApp и т. д., мы не генерируем и не храним приватные ключи, вы создаете и храните их сами. Только вы и ваш собеседник имеете доступ к вашим сообщениям. Построено на обмене ключами Диффи-Хеллмана и AES шифровании секретным ключом на стороне клиента",
    "h_e_3": "Создайте аккаунт, указав только имя пользователя и пароль. Совершенно бесплатно.",
    "h_e_4": "Обменяйтесь друг с другом именами пользователей через обычный канал связи",
    "h_e_5": "Первый пользователь создает комнату, второй пользователь подтверждает",
    "h_e_6": "Введите свой приватный ключ для чтения, отправки и получения сообщений",
    "h_e_7": "Для тестирования создайте комнату для пользователя messedges",
    "c_a": "Создать аккаунт",
    "l_i": "Войти",
    "u_n": "Имя пользователя",
    "p_w": "Пароль",
    "l_h": "длина",
    "o_t_a": "Только два аккаунта на один IP",
    "l_e": "Язык",
    "s_e": "Сохранить",
    "i_u": "Имя пользователя собеседника",
    "p_k": "Приватный ключ",
    "c_r": "Создать комнату",
    "s_p_k": "Установить закрытый ключ",
    "c_m": "Подтвердить",
    "w_g": "Ожидание",
    "m_s": "сообщения",
    "u_d": "непрочитано",
    "d_r": "Удалить комнату",
    "w_m": "Написать сообщение",
    "a_r": "Аватар"
  }
}