{
  "en": {
    "h_e_1": "End-to-end encryption messenger in which you are confident",
    "h_e_2": "Unlike Telegram, WhatsApp, etc. we don't generate and store private keys, you create and store them yourself. Only you and your interlocutor have access to your messages. Built on Diffie-Hellman key exchange and AES encryption with a secret key on the client side",
    "h_e_3": "Create an account with a username and password only. Completely free.",
    "h_e_4": "Exchange with each other the usernames through regular communication channel",
    "h_e_5": "The first user creates the room, the second user confirms",
    "h_e_6": "Enter your private key to read, send and receive messages",
    "h_e_7": "For testing create a room for user messedges",
    "t_b": "Enable notifications in",
    "i_e": "image encryption software. Send the encrypted image through regular communication channel and password through Messedges",
    "c_a": "Create an account",
    "l_i": "Log in",
    "u_n": "Username",
    "p_w": "Password",
    "l_h": "length",
    "o_t_a": "Only two accounts per IP",
    "l_e": "Language",
    "s_e": "Save",
    "i_u": "Interlocutor's username",
    "p_k": "Private key",
    "c_r": "Create room",
    "r_s": "Rooms",
    "s_p_k": "Set Private Key",
    "c_m": "Confirm",
    "w_g": "Waiting",
    "m_s": "Messages",
    "d_r": "Delete room",
    "w_m": "Write a message",
    "f_m_w": "It's very important to enter the private key correctly for the first messages",
    "a_r": "Avatar",
    "max_s": "max size",
    "t_z": "Timezone",
    "n_p": "New password",
    "d_t": "Disable Telegram",
    "l_o": "Log out",
    "d_a": "Delete an account"
  },
  "ru": {
    "h_e_1": "Мессенджер со сквозным шифрованием, в котором вы уверены",
    "h_e_2": "В отличие от Telegram, WhatsApp и т. д., мы не генерируем и не храним приватные ключи, вы создаете и храните их сами. Только вы и ваш собеседник имеете доступ к вашим сообщениям. Построено на обмене ключами Диффи-Хеллмана и AES шифровании секретным ключом на стороне клиента",
    "h_e_3": "Создайте аккаунт, указав только имя пользователя и пароль. Совершенно бесплатно.",
    "h_e_4": "Обменяйтесь друг с другом именами пользователей через обычный канал связи",
    "h_e_5": "Первый пользователь создает комнату, второй пользователь подтверждает",
    "h_e_6": "Введите свой приватный ключ для чтения, отправки и получения сообщений",
    "h_e_7": "Для тестирования создайте комнату для пользователя messedges",
    "t_b": "Включите уведомления в",
    "i_e": "программа для шифрования изображений. Отправьте зашифрованное изображение через обычный канал связи и пароль через Messedges",
    "c_a": "Создать аккаунт",
    "l_i": "Войти",
    "u_n": "Имя пользователя",
    "p_w": "Пароль",
    "l_h": "длина",
    "o_t_a": "Только два аккаунта на один IP",
    "l_e": "Язык",
    "s_e": "Сохранить",
    "i_u": "Имя пользователя собеседника",
    "p_k": "Приватный ключ",
    "c_r": "Создать комнату",
    "r_s": "Комнаты",
    "s_p_k": "Установите приватный ключ",
    "c_m": "Подтвердить",
    "w_g": "Ожидание",
    "m_s": "Сообщения",
    "d_r": "Удалить комнату",
    "w_m": "Написать сообщение",
    "f_m_w": "Очень важно правильно ввести приватный ключ для первых сообщений.",
    "a_r": "Аватар",
    "max_s": "максимальный размер",
    "t_z": "Часовой пояс",
    "n_p": "Новый пароль",
    "d_t": "Удалить Telegram",
    "l_o": "Выйти",
    "d_a": "Удалить аккаунт"
  },
  "fr": {
    "h_e_1": "Messager de chiffrement de bout en bout dans lequel vous avez confiance",
    "h_e_2": "Contrairement à Telegram, WhatsApp, etc., nous ne générons ni ne stockons de clés privées, vous les créez et les stockez vous-même. Seuls vous et votre interlocuteur avez accès à vos messages. Construit sur l'échange de clés Diffie-Hellman et le cryptage AES avec une clé secrète côté client",
    "h_e_3": "Créez un compte avec un nom d'utilisateur et un mot de passe uniquement. Entièrement gratuit.",
    "h_e_4": "Échangez entre vous les noms d'utilisateur via un canal de communication régulier",
    "h_e_5": "Le premier utilisateur crée la salle, le deuxième utilisateur confirme",
    "h_e_6": "Entrez votre clé privée pour lire, envoyer et recevoir des messages",
    "h_e_7": "Pour les tests, créez une salle pour les messages des utilisateurs",
    "t_b": "Activer les notifications dans",
    "i_e": "logiciel de cryptage d'image. Envoyez l'image cryptée via le canal de communication habituel et le mot de passe via Messedges",
    "c_a": "Créer un compte",
    "l_i": "Se connecter",
    "u_n": "Nom d'utilisateur",
    "p_w": "Mot de passe",
    "l_h": "longueur",
    "o_t_a": "Seulement deux comptes par IP",
    "l_e": "Langue",
    "s_e": "Enregistrer",
    "i_u": "Nom d'utilisateur de l'interlocuteur",
    "p_k": "Clé privée",
    "c_r": "Créer un salon",
    "r_s": "Pièces",
    "s_p_k": "Définir la clé privée",
    "c_m": "Confirmer",
    "w_g": "En attente",
    "m_s": "Messages",
    "d_r": "Supprimer la pièce",
    "w_m": "Ecrire un message",
    "f_m_w": "Il est très important de saisir correctement la clé privée pour les premiers messages",
    "a_r": "Avatar",
    "max_s": "taille maximale",
    "t_z": "Fuseau horaire",
    "n_p": "Nouveau mot de passe",
    "d_t": "Désactiver le télégramme",
    "l_o": "Se déconnecter",
    "d_a": "Supprimer un compte"
  },
  "de": {
    "h_e_1": "Messenger mit Ende-zu-Ende-Verschlüsselung, auf den Sie vertrauen",
    "h_e_2": "Im Gegensatz zu Telegram, WhatsApp usw. generieren und speichern wir keine privaten Schlüssel, Sie erstellen und speichern sie selbst. Nur Sie und Ihr Gesprächspartner haben Zugriff auf Ihre Nachrichten. Basierend auf Diffie-Hellman-Schlüsselaustausch und AES-Verschlüsselung mit einem geheimen Schlüssel auf der Client-Seite",
    "h_e_3": "Erstellen Sie ein Konto nur mit einem Benutzernamen und einem Passwort. Völlig kostenlos.",
    "h_e_4": "Benutzernamen über reguläre Kommunikationskanäle austauschen",
    "h_e_5": "Der erste Benutzer erstellt den Raum, der zweite Benutzer bestätigt",
    "h_e_6": "Geben Sie Ihren privaten Schlüssel ein, um Nachrichten zu lesen, zu senden und zu empfangen",
    "h_e_7": "Zum Testen einen Raum für Benutzernachrichten erstellen",
    "t_b": "Benachrichtigungen aktivieren in",
    "i_e": "Bildverschlüsselungssoftware. Senden Sie das verschlüsselte Bild über den regulären Kommunikationskanal und das Passwort über Messedges",
    "c_a": "Konto erstellen",
    "l_i": "Anmelden",
    "u_n": "Benutzername",
    "p_w": "Passwort",
    "l_h": "Länge",
    "o_t_a": "Nur zwei Konten pro IP",
    "l_e": "Sprache",
    "s_e": "Speichern",
    "i_u": "Benutzername des Gesprächspartners",
    "p_k": "Privater Schlüssel",
    "c_r": "Raum erstellen",
    "r_s": "Räume",
    "s_p_k": "Privaten Schlüssel setzen",
    "c_m": "Bestätigen",
    "w_g": "Warten",
    "m_s": "Nachrichten",
    "d_r": "Raum löschen",
    "w_m": "Nachricht schreiben",
    "f_m_w": "Für die ersten Nachrichten ist es sehr wichtig, den privaten Schlüssel korrekt einzugeben",
    "a_r": "Avatar",
    "max_s": "maximale Größe",
    "t_z": "Zeitzone",
    "n_p": "Neues Passwort",
    "d_t": "Telegramm deaktivieren",
    "l_o": "Abmelden",
    "d_a": "Konto löschen"
  },
  "es": {
    "h_e_1": "Mensajería de cifrado de extremo a extremo en la que confía",
    "h_e_2": "A diferencia de Telegram, WhatsApp, etc., no generamos ni almacenamos claves privadas, tú mismo las creas y almacenas. Solo tú y tu interlocutor tienen acceso a tus mensajes. Basado en el intercambio de claves Diffie-Hellman y encriptación AES con una clave secreta en el lado del cliente",
    "h_e_3": "Crea una cuenta solo con nombre de usuario y contraseña. Completamente gratis.",
    "h_e_4": "Intercambiar los nombres de usuario a través del canal de comunicación habitual",
    "h_e_5": "El primer usuario crea la sala, el segundo usuario confirma",
    "h_e_6": "Ingresa tu clave privada para leer, enviar y recibir mensajes",
    "h_e_7": "Para las pruebas, cree una sala para los mensajes de los usuarios",
    "t_b": "Habilitar notificaciones en",
    "i_e": "software de encriptación de imágenes. Envíe la imagen encriptada a través del canal de comunicación regular y la contraseña a través de Messedges",
    "c_a": "Crear una cuenta",
    "l_i": "Iniciar sesión",
    "u_n": "Nombre de usuario",
    "p_w": "Contraseña",
    "l_h": "longitud",
    "o_t_a": "Solo dos cuentas por IP",
    "l_e": "Idioma",
    "s_e": "Guardar",
    "i_u": "Nombre de usuario del interlocutor",
    "p_k": "Clave privada",
    "c_r": "Crear sala",
    "r_s": "Habitaciones",
    "s_p_k": "Establecer clave privada",
    "c_m": "Confirmar",
    "w_g": "Esperando",
    "m_s": "Mensajes",
    "d_r": "Eliminar sala",
    "w_m": "Escribe un mensaje",
    "f_m_w": "Es muy importante ingresar correctamente la clave privada para los primeros mensajes",
    "a_r": "Avatar",
    "max_s": "tamaño máximo",
    "t_z": "Zona horaria",
    "n_p": "Nueva contraseña",
    "d_t": "Deshabilitar Telegrama",
    "l_o": "Cerrar sesión",
    "d_a": "Eliminar una cuenta"
  },
  "it": {
    "h_e_1": "Messaggero di crittografia end-to-end in cui sei sicuro",
    "h_e_2": "A differenza di Telegram, WhatsApp, ecc. non generiamo e conserviamo chiavi private, le crei e conservi tu stesso. Solo tu e il tuo interlocutore avete accesso ai vostri messaggi. Basato sullo scambio di chiavi Diffie-Hellman e sulla crittografia AES con una chiave segreta sul lato client",
    "h_e_3": "Crea un account solo con nome utente e password. Completamente gratuito.",
    "h_e_4": "Scambiatevi reciprocamente i nomi utente attraverso il normale canale di comunicazione",
    "h_e_5": "Il primo utente crea la stanza, il secondo utente conferma",
    "h_e_6": "Inserisci la tua chiave privata per leggere, inviare e ricevere messaggi",
    "h_e_7": "Per i test crea una stanza per i messaggi degli utenti",
    "t_b": "Abilita le notifiche in",
    "i_e": "software di crittografia delle immagini. Invia l'immagine crittografata tramite il normale canale di comunicazione e la password tramite Messedges",
    "c_a": "Crea un account",
    "l_i": "Accedi",
    "u_n": "Nome utente",
    "p_w": "Password",
    "l_h": "lunghezza",
    "o_t_a": "Solo due account per IP",
    "l_e": "Lingua",
    "s_e": "Salva",
    "i_u": "Nome utente dell'interlocutore",
    "p_k": "Chiave privata",
    "c_r": "Crea stanza",
    "r_s": "Stanze",
    "s_p_k": "Imposta chiave privata",
    "c_m": "Conferma",
    "w_g": "In attesa",
    "m_s": "Messaggi",
    "d_r": "Elimina stanza",
    "w_m": "Scrivi un messaggio",
    "f_m_w": "È molto importante inserire correttamente la chiave privata per i primi messaggi",
    "a_r": "Avatar",
    "max_s": "dimensione massima",
    "t_z": "Fuso orario",
    "n_p": "Nuova password",
    "d_t": "Disabilita Telegramma",
    "l_o": "Esci",
    "d_a": "Elimina un account"
  },
  "jp": {
    "h_e_1": "信頼できるエンドツーエンドの暗号化メッセンジャー",
    "h_e_2": "Telegram や WhatsApp などとは異なり、私たちは秘密鍵を生成して保存しません。自分で作成して保存します。メッセージにアクセスできるのは、あなたと対話者だけです。Diffie-Hellman キー交換と AES 暗号化に基づいています。クライアント側で秘密鍵を使用する",
    "h_e_3": "ユーザー名とパスワードのみでアカウントを作成します。完全に無料です。",
    "h_e_4": "通常の通信チャネルを通じてユーザー名を相互に交換する",
    "h_e_5": "最初のユーザーがルームを作成し、2 番目のユーザーが確認します",
    "h_e_6": "メッセージを読み、送受信するには秘密鍵を入力してください",
    "h_e_7": "テスト用に、ユーザー メッセージ用の部屋を作成します",
    "t_b": "通知を有効にする",
    "i_e": "画像暗号化ソフトウェア。通常の通信チャネルを介して暗号化された画像を送信し、Messedges を介してパスワードを送信します",
    "c_a": "アカウントを作成する",
    "l_i": "ログイン",
    "u_n": "ユーザー名",
    "p_w": "パスワード",
    "l_h": "長さ",
    "o_t_a": "IP ごとに 2 つのアカウントのみ",
    "l_e": "言語",
    "s_e": "保存",
    "i_u": "対話者のユーザー名",
    "p_k": "秘密鍵",
    "c_r": "部屋を作る",
    "r_s": "部屋",
    "s_p_k": "秘密鍵を設定",
    "c_m": "確認",
    "w_g": "待っています",
    "m_s": "メッセージ",
    "d_r": "部屋を削除",
    "w_m": "メッセージを書く",
    "f_m_w": "最初のメッセージで秘密鍵を正しく入力することが非常に重要です",
    "a_r": "アバター",
    "max_s": "最大サイズ",
    "t_z": "タイムゾーン",
    "n_p": "新しいパスワード",
    "d_t": "テレグラムを無効にする",
    "l_o": "ログアウト",
    "d_a": "アカウントを削除する"
  }
}
